[
    {
        "projectId": "sse",
        "year": "2018 - Present",
        "role": "Senior Engineer",
        "stack": "Angular 7, TypeScript, RxJS",
        "layout": [
            {
                "image": "sse01.png",
                "description": "SaltStack Enterprise is the award-winning enterprise application that leverages the powerful features of the Salt open-source project. As a Senior Engineer on the SaltStack Enterprise UI team, I've been a core contributor to the many features that SaltStack Enterprise offers."
            },
            {
                "image": "sse02.png",
                "description": "The move from version 5 to version 6 presented many challenges. There was the introduction of a new component system, feature enhancements and additions, as well as a heavy framework migration. In the end, my team and I were able to release a quality product on time and deliver on our commitments."
            },
            {
                "image": "sse03.png",
                "description": "I'm still an engineer at SaltStack and I have the pleasure to continually lead in the efforts of new feature development, code reviews and architecture for the enterprise application."
            }
        ]
    },
    {
        "projectId": "pom-wonderful",
        "year": "2017",
        "role": "Lead Engineer",
        "stack": "React, Redux, PixiJS, JSON Schema, Webpack",
        "layout": [
            {
                "image": "pom01.png",
                "description": "Impossible Bureau was approached to develop the new pomwonderful.com website. The design was ambitious, the timeline was tight, but in the end pomwonderful.com ended up being one of the most fun projects I've worked on."
            },
            {
                "image": "pom02.png",
                "description": "Taking advantage of React's modularity, I built the navigation framework which would ingest JSON files that were used to populate each view. The files were validated using JSON Schema, which would run as an automated test in our CI pipeline. We went with raw JSON for the data because the CMS for the website was being developed by POM in AEM in parallel. The POM team and IB agreed on a data contract which ended up working flawlessly when pomwonderful.com launched."
            },
            {
                "image": "pom03.png",
                "description": "PixiJS was used to take advantage of the WebGL context in the HTML5 Canvas for the more advanced animations, we used TweenMax and CSS3 for the more simple transitions and hover states. The hard work and attention to detail paid off when pomwonderful.com was a winner of CSS Awards."
            }
        ]
    },
    {
        "projectId": "wind-and-words",
        "year": "2017",
        "role": "Lead Engineer",
        "stack": "React, Flux (Facebook Dispatcher), PixiJS, Webpack",
        "layout": [
            {
                "image": "waw01.png",
                "description": "Impossible Bureau is known in the industry for their design and creative technology. During the winter of 2016, we decided to build an internal project, Wind and Words which paid homage to one of our favorite HBO shows, The Game of Thrones."
            },
            {
                "image": "waw02.png",
                "description": "Part of my role on the project was architecting a url-driven, transition framework. This framework introduced hooks for animating in and out between pages. I leveraged the Facebook Dispatcher (the precursor to Redux), to take advantage of the Flux pattern.Each page will transition differently based on whether you're navigating from season to season, episode to episode, or section to menu."
            },
            {
                "image": "waw03.png",
                "description": "The transitions used the WebGL context in PixJS. We chose Pixi because it presented an interface that was similar to the AS3 DisplayObject API that we were all familiar with from our days in flash. In our free time from the project's inception we were able to launch an award-winning internal project that caught the eyes of several businesses. The result: more awards under our belt and some exciting and new projects to work on."
            }
        ]
    },
    {
        "projectId": "cheetos-museum",
        "year": "2017",
        "role": "Senior Engineer",
        "stack": "React, Redux, TweenMax",
        "layout": [
            {
                "image": "cm01.jpg",
                "description": "Cheetosmuseum.com was easily one of my favorite projects or be a part of. The design was simple and clean. The application was fun. I was able to work with great agencies in the process."
            },
            {
                "image": "cm02.jpg",
                "description": "The idea behind this project was users would upload photos of cheetos that looked like things. Once registered you would be able to upload and vote for your favorite cheeto masterpiece."
            },
            {
                "image": "cm03.jpg",
                "description": "My role on this project was building out some of the main pages in the UI. This project was also my introduction to Redux, which was prefect for this stateful application."
            }
        ]
    },
    {
        "projectId": "impossible-bureau",
        "year": "2014",
        "role": "Lead Engineer",
        "stack": "Coffeescript, TweenMax, ThreeJS",
        "layout": [
            {
                "image": "ib01.png",
                "description": "Impossiblebureau.com was probably the first website that I was heavily invested in. It was the introduction of a new brand for the agency, probably the first website that used a pink and purple gradient, and my first project as an Associate Technical Director."
            },
            {
                "image": "ib02.png",
                "description": "We went with Coffeescript for the project. I built a navigation framework that was URL-driven and used a FSM to determine which route goes to what page. All routes are caught using the HTML5 History API and routed to their destination using this approach."
            },
            {
                "image": "ib03.png",
                "description": "Perhaps the most noteworthy piece of the project is the studio page. I brought in my XBox Kinnect and did 3D scans of each employee. The scans were exported to JSON and pulled in using ParticleSaga, a particle transition library built by one of the other engineer at IB."
            }
        ]
    },
    {
        "projectId": "ctos",
        "year": "2014",
        "role": "Senior Engineer",
        "stack": "ES5, CSS3, TweenMax",
        "layout": [
            {
                "image": "ctos01.png",
                "description": "Impossible Bureau was approached to develop the ctOS website for the up coming game Watch Dogs. The intention of the website was to present the user with the store of ctOS—the central operating system which monitored Chicago."
            },
            {
                "image": "ctos02.png",
                "description": "The website was time-lined base and played like a video for the user. You could sit back and watch the story unfold. Each section, or chapter, of the \"video\" was deep linked and has animated transitions for the presentation and exit states."
            },
            {
                "image": "ctos03.png",
                "description": "My role on the project was to develop a few of the chapters in the website on top of the timeline framework that was implemented by my colleague at IB. Along with the chapters, I also built a reusable text scramble class which you can see being used throughout the website. In the end Impossible Bureau was able to deliver an award winning website under a tight timeline."
            }
        ]
    },
    {
        "projectId": "nick-app",
        "year": "2013",
        "role": "Engineer",
        "stack": "iOS",
        "layout": [
            {
                "image": "nick01.jpg",
                "description": "Perhaps the most challenging application I worked on was the Nick App for Nickelodeon Digital in 2013. This was my first large-production iOS application and also a pivotal point in my career as I was making the transition from a junior to intermediate engineer. My Objective-C experience was limited at the time, but myself and the rest of the Fantasy team were able to go heads down and build the Emmy-award winning iPad application."
            }
        ]
    },
    {
        "projectId": "messages-for-japan",
        "year": "2011",
        "role": "Junior Engineer",
        "stack": "ES5, jQuery",
        "layout": [
            {
                "image": "mfj01.png",
                "description": "Messages for Japan is still my favorite project that I've worked on in my career. The website was for a good cause and was linked on the google.com homepage for some time. This was also my first JavaScript project built from scratch, so there was a lot of learning involved in getting this website to production and up-to-par with the Google and Fantasy standards."
            },
            {
                "image": "mfj02.png",
                "description": "My role on the project was development. I worked with a couple of other engineers to get this website out the door. The backend was built using a slimed down version of Django on top of Google's App Engine deployment system. With my AS3 Pure MVC experience, I built a FSM on the frontend which handled transitions between animated components on each page."
            },
            {
                "image": "mfj03.jpg",
                "description": "All-in-all the project was delivered in a short amount of time. A lot of late nights went into this project, but the result was a website which allowed users from around the globe to send messages of hope to the victims and families who were impacted by the 2011 tsunami in Japan. This website would go on to win the prestigious FWA — Site of the Day award, which at the time (Flash days) was not common for a HTML website."
            }
        ]
    }
]
